.config/emacs/my-init.org

#+property: header-args
#+startup: content

* ~early-init.el~

** use plists (for lsp performance)
#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  (setenv "LSP_USE_PLISTS" "true")
#+end_src

** disable package for elpaca
#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
  (setq package-enable-at-startup nil)
#+end_src

** Find gcc and libgccjit packages to be used for emacs on macOS
#+begin_src emacs-lisp :tangle "early-init.el" :mkdirp yes
(defun homebrew-gcc-paths ()
  "Return GCC library paths from Homebrew installations.
  Detects paths for gcc and libgccjit packages to be used in LIBRARY_PATH."
  (let* ((paths '())
         (brew-bin
          (or (executable-find "brew")
              (let ((arm-path "/opt/homebrew/bin/brew")
                    (intel-path "/usr/local/bin/brew"))
                (cond
                 ((file-exists-p arm-path)
                  arm-path)
                 ((file-exists-p intel-path)
                  intel-path))))))

    (when brew-bin
      ;; Get gcc paths.
      (let* ((gcc-prefix
              (string-trim
               (shell-command-to-string
                (concat brew-bin " --prefix gcc"))))
             (gcc-lib-current
              (expand-file-name "lib/gcc/current" gcc-prefix)))
        (push gcc-lib-current paths)

        ;; Find apple-darwin directory.
        (let* ((default-directory gcc-lib-current)
               (arch-dirs
                (file-expand-wildcards "gcc/*-apple-darwin*/*[0-9]")))
          (when arch-dirs
            (push (expand-file-name (car (sort arch-dirs #'string>)))
                  paths))))

      ;; Get libgccjit paths
      (let* ((jit-prefix
              (string-trim
               (shell-command-to-string
                (concat brew-bin " --prefix libgccjit"))))
             (jit-lib-current
              (expand-file-name "lib/gcc/current" jit-prefix)))
        (push jit-lib-current paths)))

    (nreverse paths)))

(defun setup-macos-native-comp-library-paths ()
  "Set up LIBRARY_PATH for native compilation on macOS.
  Includes Homebrew GCC paths and CommandLineTools SDK libraries."
  (let*
      ((existing-paths
        (split-string (or (getenv "LIBRARY_PATH") "") ":" t))
       (gcc-paths (homebrew-gcc-paths))
       (clt-paths
        '("/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
       (unique-paths
        (delete-dups (append existing-paths gcc-paths clt-paths))))

    (setenv "LIBRARY_PATH" (mapconcat #'identity unique-paths ":"))))

;; Set up library paths for native compilation on macOS.
(when (eq system-type 'darwin)
  (setup-macos-native-comp-library-paths))
#+end_src

* ~init.el~

** Initialize package repositories (no longer working elpaca now)
#+begin_src emacs-lisp 
(require 'package)
(add-to-list
 'package-archives '("melpa" . "https://melpa.org/packages/")
 t)
;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
;; and `package-pinned-packages`. Most users will not need or want to do this.
;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)
#+end_src

** Initialize elpaca
*** Install
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory
  (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory
  (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory
  (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order
  '(elpaca
    :repo "https://github.com/progfolio/elpaca.git"
    :ref nil
    :depth 1
    :inherit ignore
    :files (:defaults "elpaca-test.el" (:exclude "extensions"))
    :build (:not elpaca--activate-package)))
(let* ((repo (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list
   'load-path
   (if (file-exists-p build)
       build
     repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (<= emacs-major-version 28)
      (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer
                   (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop
                    (apply #'call-process
                           `("git" nil ,buffer t "clone" ,@
                             (when-let* ((depth
                                          (plist-get order :depth)))
                               (list
                                (format "--depth=%d" depth)
                                "--no-single-branch"))
                             ,(plist-get order :repo) ,repo))))
                  ((zerop
                    (call-process "git"
                                  nil
                                  buffer
                                  t
                                  "checkout"
                                  (or (plist-get order :ref) "--"))))
                  (emacs
                   (concat invocation-directory invocation-name))
                  ((zerop
                    (call-process
                     emacs
                     nil
                     buffer
                     nil
                     "-Q"
                     "-L"
                     "."
                     "--batch"
                     "--eval"
                     "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
          (progn
            (message "%s" (buffer-string))
            (kill-buffer buffer))
          (error
           "%s"
           (with-current-buffer buffer
             (buffer-string))))
      ((error)
       (warn "%s" err)
       (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil))
      (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

*** use-package integration
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(elpaca
 elpaca-use-package
 ;; Enable Elpaca support for use-package's :ensure keyword.
 (elpaca-use-package-mode))
#+end_src

** Basic emacs configuration

*** Start emacs maximized
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(add-hook 'window-setup-hook 'toggle-frame-maximized t)
#+end_src

*** Set font depending on OS

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(pcase system-type
  ((or 'gnu/linux 'windows-nt 'cygwin)
   (set-face-attribute 'default nil
                       :family "Iosevka Nerd Font Mono"
                       :weight 'regular))
  ('darwin
   (set-face-attribute 'default nil
                       :family "IosevkaTerm Nerd Font Mono"
                       :weight 'regular)))
#+end_src

*** Disable unneeded features
- These settings are very commonly used to turn emacs into a more suitable editor for programmers
  
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(setq ring-bell-function #'ignore)
(setq inhibit-startup-message t)
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

*** Enable buffer line numbers
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(global-display-line-numbers-mode 1)
(hl-line-mode 1)
#+end_src

*** Enable history settings
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(recentf-mode 1)
(setq history-length 25)
(savehist-mode 1)
(save-place-mode 1)
#+end_src

*** Notice and show changes made to files outside emacs 
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

*** Disable cursors in the minibuffer prompt
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(setq minibuffer-prompt-properties
      '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

*** Allow the use of mini buffer commands inside a mini buffer
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(setq enable-recursive-minibuffers t)
(minibuffer-depth-indicate-mode 1)  
#+end_src

*** Set custom-file to random file
- This file will be the repository for customizations emacs /would/ have written in ~init.el~ whenever ~M-x customize~ related commands are executed
- Can even be turned into temporary file, might do that so they never persist

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(setq custom-file (locate-user-emacs-file "custom-vars.el"))
(load custom-file 'noerror 'nomessage)
;; Disable the damn thing by making it disposable. 
;; (setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

*** Create ~hyper~ modifier functionality
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(setq w32-pass-apps-to-system nil)
(setq w32-apps-modifier 'hyper)

;;(defconst my-leader (if (eq system-type 'darwin) "SPC" "SPC"))
(defun enable-hyper-super-modifiers-linux-x ()
  ;; on nowadays linux, <windows> key is usually configured to Super

  ;; menu key as hyper (Note: for H-s, you need to release <menu> key before pressing 's')
  (define-key key-translation-map [menu] 'event-apply-hyper-modifier) ;H-
  ;;(define-key key-translation-map [apps] 'event-apply-hyper-modifier)

  ;; by default, Emacs bind <menu> to execute-extended-command (same as M-x) now <menu> defined as 'hyper, we need to press <menu> twice to get <H-menu> (global-set-key (kbd "<H-menu>") 'execute-extended-command)
  )

(enable-hyper-super-modifiers-linux-x)
#+end_src

*** Vertico prompt indicator
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
;; Vertico settings
;; Add prompt indicator to `completing-read-multiple'.
;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
(defun crm-indicator (args)
  (cons
   (format "[CRM%s] %s"
           (replace-regexp-in-string
            "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" "" crm-separator)
           (car args))
   (cdr args)))
(advice-add #'completing-read-multiple :filter-args #'crm-indicator)
#+end_src

* Load packages and modules
#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("tony-lisp" "tony-emacs-modules"))

(require 'tony-emacs-miscellaneous)
(require 'tony-emacs-org)
(require 'tony-emacs-project)
;;(require 'tony-emacs-treemacs)
(require 'tony-emacs-meow)
(require 'tony-emacs-which-key)
(require 'tony-emacs-doom-themes)
(require 'tony-emacs-solaire-mode)
(require 'tony-emacs-doom-modeline)
(require 'tony-emacs-textsize)
(require 'tony-emacs-vertico)
(require 'tony-emacs-marginalia)
(require 'tony-emacs-orderless)
(require 'tony-emacs-consult)
(require 'tony-emacs-magit)
(require 'tony-emacs-denote)
(require 'tony-emacs-completion)
(require 'tony-emacs-linter)
(require 'tony-emacs-prettier)
(require 'tony-emacs-treesit)
(require 'tony-emacs-lsp-mode)
;;(require 'tony-emacs-lsp-treemacs)
(require 'tony-emacs-ngx)
(require 'tony-emacs-lsp-biome)
#+end_src

* Packages
