.config/emacs/my-init.org
*** use and config embark
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-embark.el" :mkdirp yes
(use-package
 embark
 :ensure t

 :bind
 (("C-." . embark-act) ;; pick some comfortable binding
  ("C-;" . embark-dwim) ;; good alternative: M-.
  ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'

 :init

 ;; Optionally replace the key help with a completing-read interface
 (setq prefix-help-command #'embark-prefix-help-command)

 ;; Show the Embark target at point via Eldoc. You may adjust the
 ;; Eldoc strategy, if you want to see the documentation from
 ;; multiple providers. Beware that using this can be a little
 ;; jarring since the message shown in the minibuffer can be more
 ;; than one line, causing the modeline to move up and down:

 ;; (add-hook 'eldoc-documentation-functions #'embark-eldoc-first-target)
 ;; (setq eldoc-documentation-strategy #'eldoc-documentation-compose-eagerly)

 :config

 ;; Hide the mode line of the Embark live/completions buffers
 (add-to-list
  'display-buffer-alist
  '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
    nil
    (window-parameters (mode-line-format . none)))))
#+end_src

*** use and config embark-consult
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-embark.el" :mkdirp yes
;; Consult users will also want the embark-consult package.
(use-package
 embark-consult
 :ensure t ; only need to install it, embark loads it after consult if found
 :hook (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-embark.el" :mkdirp yes
(provide 'tony-emacs-embark)
#+end_src

** ~magit.el~
*** use and config magit
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-magit.el" :mkdirp yes
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;                MAGIT               ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; remove last unmerged commit (set as unstaged change)
;; (magit-reset-soft "HEAD~1"))

;; (use-package compat
;;   :defer t
;;   :ensure (compat :type git :host github :repo "emacs-compat/compat"))

(use-package
 transient
 :defer t
 :ensure (transient :type git :host github :repo "magit/transient")
 :config

 (transient-define-prefix
  hrm-help-transient () "Help commands."
  ["Help Commands" ["Mode & Bindings"
    ("m" "Mode" describe-mode)
    ("M" "Minor Modes" consult-minor-mode-menu)
    ("b" "Major Bindings" which-key-show-full-major-mode)
    ("B" "Minor Bindings" which-key-show-full-minor-mode-keymap)
    ("d" "Descbinds" describe-bindings) ; or embark-bindings
    ("t" "Top Bindings  " which-key-show-top-level)]
   ["Describe"
    ("C" "Command" helpful-command)
    ("f" "Function" helpful-callable)
    ("v" "Variable " helpful-variable)
    ("k" "Key" helpful-key)
    ("s" "Symbol" helpful-symbol)
    ("l" "Library" apropos-library)]
   ["Info on"
    ("C-c" "Command" Info-goto-emacs-command-node)
    ("C-f" "Function" info-lookup-symbol)
    ("C-v" "Variable" info-lookup-symbol) ; fails if transient-detect-key-conflicts
    ("C-k" "Key" Info-goto-emacs-key-command-node)
    ("C-s" "Symbol" info-lookup-symbol)]
   ["Goto Source"
    ""
    ("F" "Function" find-function-other-frame)
    ("V" "Variable" find-variable-other-frame)
    ("K" "Key" find-function-on-key-other-frame)
    ""
    ("L" "Library" find-library-other-frame)]
   ["Apropos"
    ("ac" "Command" apropos-command)
    ("af" "Function" apropos-function)
    ("av" "Variable" apropos-variable)
    ("aV" "Value" apropos-value)
    ("aL" "Local Value" apropos-local-value)
    ("ad" "Documentation" apropos-documentation)]]
  [["Internals"
    ("I" "Input Method" describe-input-method)
    ("G" "Language Env" describe-language-environment)
    ("S" "Syntax" describe-syntax)
    ("T" "Categories" describe-categories)
    ("O" "Coding System" describe-coding-system)
    ("o" "Coding Briefly" describe-current-coding-system-briefly)
    ("T" "Display Table" describe-current-display-table)
    ("e" "Echo Messages" view-echo-area-messages)
    ("H" "Lossage" view-lossage)]
   ["Describe"
    ("." "At Point" helpful-at-point)
    ("c" "Key Short" describe-key-briefly)
    ("p" "Key Map" describe-keymap)
    ("A" "Face" describe-face)
    ("i" "Icon" describe-icon)
    ("w" "Where Is" where-is)
    ("=" "Position" what-cursor-position)
    ("g" "Shortdoc" shortdoc-display-group)]
   ["Info Manuals"
    ("C-i" "Info" info)
    ("C-4" "Other Window" info-other-window)
    ("C-e" "Emacs" info-emacs-manual)
    ;; ("C-l" "Elisp" info-elisp-manual)
    ("C-r" "Pick Manual" info-display-manual)]
   ["External" ("N" "Man" consult-man)
    ;; ("W" "Dictionary" lookup-word-at-point)
    ;; ("D" "Dash" dash-at-point)
    ]])
 (global-set-key (kbd "C-S-h") 'hrm-help-transient))

(use-package
 magit
 ;; fixes emacs 29 issue with old transient package (dependency)
 ;; :ensure (:tag "v3.3.0")
 ;; :after compat
 :after transient
 :defer t
 :config
 ;; ;; updates modeline with branch. higher cost than hook
 ;; (setq auto-revert-check-vc-info t
 ;;       auto-revert-interval 10)

 ;; show  all options in transient
 (setq transient-default-level 7)

 ;; full screen magit
 (setq magit-display-buffer-function
       #'magit-display-buffer-fullframe-status-v1)
 (setq magit-remote-add-set-remote.pushDefault nil)
 (setopt magit-format-file-function
         #'magit-format-file-all-the-icons)) ;; for v4.3.0+

(use-package
 magit-blame-color-by-age
 :ensure
 (magit-blame-color-by-age
  :type git
  :host github
  :repo "jdtsmith/magit-blame-color-by-age")
 :after magit
 :config (magit-blame-color-by-age-mode))

;; (defadvice vc-git-mode-line-string (after plus-minus (file) compile activate)
;;   (setq ad-return-value
;; 	(concat ad-return-value
;; 		(let ((plus-minus (vc-git--run-command-string
;; 				   file "diff" "--numstat" "--")))
;; 		  (and plus-minus
;; 		       (string-match "^\\([0-9]+\\)\t\\([0-9]+\\)\t" plus-minus)
;; 		       (format " +%s-%s" (match-string 1 plus-minus) (match-string 2 plus-minus)))))))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-magit.el" :mkdirp yes
(provide 'tony-emacs-magit)
#+end_src

** ~denote.el~
*** use and config denote
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote
 :ensure t
 :config
 (setq denote-directory (expand-file-name "~/Documents/org/denote"))
 (setq denote-known-keywords
       '("emacs"
         "org mode"
         "denote"
         "game dev"
         "godot"
         "C"
         "lisp"
         "typescript"
         "javascript"
         "angular"
         "ngrx"
         "hand tools"
         "power tools"
         "offroading"
         "preparedness")))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(provide 'tony-emacs-denote)
#+end_src

** ~treesit.el~
*** use and config treesit
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-treesit.el" :mkdirp yes
(use-package
 treesit
 :mode
 (("\\.component.html\\'" . ngxhtml-ts-mode)
  ;;("\\.html\\'"  . html-ts-mode)
  ("\\.js\\'" . typescript-ts-mode)
  ("\\.mjs\\'" . typescript-ts-mode)
  ("\\.mts\\'" . typescript-ts-mode)
  ("\\.cjs\\'" . typescript-ts-mode)
  ("\\.ts\\'" . typescript-ts-mode)
  ("\\.jsx\\'" . tsx-ts-mode)
  ("\\.json\\'" . json-ts-mode)
  ("\\.Dockerfile\\'" . dockerfile-ts-mode)
  ("\\.prisma\\'" . prisma-ts-mode)
  ("\\.yaml\\'" . yaml-ts-mode)
  ;; More modes defined here...
  )
 :preface
 (defun tb/setup-install-grammars ()
   "Install Tree-sitter grammars if they are absent."
   (interactive)
   (dolist
       (grammar
        '((css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (angular
           "https://github.com/dlvandenberg/tree-sitter-angular")
          (javascript
           .
           ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (python
           . ("https://github.com/tree-sitter/tree-sitter-python"))
          (markdown
           "https://github.com/ikatyang/tree-sitter-markdown")
          (make "https://github.com/alemuller/tree-sitter-make")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (gdscript
           "https://github.com/PrestonKnopp/tree-sitter-gdscript")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (toml
           .
           ("https://github.com/tree-sitter/tree-sitter-toml"
            "v0.5.1"))
          (tsx
           .
           ("https://github.com/tree-sitter/tree-sitter-typescript"
            "v0.20.3"
            "tsx/src"))
          (typescript
           .
           ("https://github.com/tree-sitter/tree-sitter-typescript"
            "v0.20.3"
            "typescript/src"))
          (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))
          (prisma "https://github.com/victorhqc/tree-sitter-prisma")))
     (add-to-list 'treesit-language-source-alist grammar)
     ;; Only install `grammar' if we don't already have it
     ;; installed. However, if you want to *update* a grammar then
     ;; this obviously prevents that from happening.
     (unless (treesit-language-available-p (car grammar))
       (treesit-install-language-grammar (car grammar)))))

 ;; Optional, but recommended. Tree-sitter enabled major modes are
 ;; distinct from their ordinary counterparts.
 ;;
 ;; You can remap major modes with `major-mode-remap-alist'. Note
 ;; that this does *not* extend to hooks! Make sure you migrate them
 ;; also
 (dolist (mapping
          '((python-mode . python-ts-mode)
            (css-mode . css-ts-mode)
            (typescript-mode . typescript-ts-mode)
            (js-mode . typescript-ts-mode)
            (js2-mode . typescript-ts-mode)
            (c-mode . c-ts-mode)
            (c++-mode . c++-ts-mode)
            (c-or-c++-mode . c-or-c++-ts-mode)
            (bash-mode . bash-ts-mode)
            (css-mode . css-ts-mode)
            (json-mode . json-ts-mode)
            (js-json-mode . json-ts-mode)
            (sh-mode . bash-ts-mode)
            (sh-base-mode . bash-ts-mode)))
   (add-to-list 'major-mode-remap-alist mapping))
 :config (tb/setup-install-grammars) (setq treesit-font-lock-level 6))

(provide 'tony-emacs-treesit)
#+end_src

** ~linter.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-linter.el" :mkdirp yes
(use-package
 flycheck
 :ensure t
 :init (global-flycheck-mode)
 :bind
 (:map
  flycheck-mode-map
  ("M-n" . flycheck-next-error) ; optional but recommended error navigation
  ("M-p" . flycheck-previous-error)))

(provide 'tony-emacs-linter)
#+end_src

